const fa = {
  footer:{
    phone:"تلفن تماس",
    text:"برای تغییر این متن بر روی دکمه ویرایش کلیک کنید. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.",
    copyRight:"تمامی حقوق برای اس پی کد محفوظ می باشد.",
    access:"دسترسی سریع",
    sections:"بخش های سایت",
    icons:"نمادهای سایت",
    contactUs:"تماس با ما",
    aboutUs:"درباره ما",
    cart:"سبد خرید",
    myAccount:"حساب کاربری من",
    subscription:"اشتراک ویژه",
    Blog:"وبلاگ",
    store:"فروشگاه",
    payment:"پرداخت قسطی",
  },
  nextBootCamp: "بوت کمپ بعدی",
  winter: "زمستان",
  year: 1403,
  siteSlogen: "برنامه نویسی را سریع و آسان یاد بگیرید",
  siteSlogen2:
    "یادگیری برنامه‌نویسی آرزو نیست، فقط نیاز هست تلاش و تمرین داشته باشید، بقیه‌اش با ما !",
  showCourses: "مشاهده دوره ها",
  student: "دانشجو",
  demoCourses: {
    Business: "کسب و کار",
    php: "برنامه نویسی php",
    seo: "سئوی تکنیکال",
    android: "برنامه نویسی اندروید",
    js: "جاوااسکریپت",
  },
  topCourses: "دوره های برتر آکادمی",
  textTopCourses: "تدریس حرفه ای و یادگیری آسان",
  reviewsName: {
    mehdi: "مهدی جان نثاری",
    ava: "آوا فتحعلی",
    pariya: "پریا ولی",
  },
  studentsSays: "دانشجویان ما چه می گویند",
  textStudentsSays: "صدای شما را می شنویم و تا آخرین قدم کنارتان هستیم",
  decriptionStudentSays:
    "تا قبل از آشنایی با خدمات طراحی اپلیکیشن شما تجربه ناموفقی را با دو شرکت مختلف تجربه کردم که منجر به شکست شد. اما بعد از تحویل اپلیکیشن ساخته شده توسط شما کسب و کارم متحول شد.",
  learning: {
    titr: "مسیر یادگیری برنامه نویسی",
    text: "نقشه راه ورود به دنیای کدنویسی",
    front: "اصول فرانت اند",
    back: "شروع بک اند",
    hack: "هک و امنیت",
    frame: "فریم ورک ها",
    portfolio: "ساخت نمونه کار",
    recruitment: "استخدام موفق",
  },
  timer:{
    titr:"منتظر اتفاق های خوب باشید ...",
    text:"ثبت نام کن تا زودتر از همه باخبر بشی!",
    name:"نام و نام خانوادگی",
    email:"آدرس ایمیل",
    send:"ارسال",
    day:"روز",
    hour:"ساعت",
    minute:"دقیق",
    second:"ثانیه"
  },
  
  //coursesPage

  myCourses:"دوره های ما",
  
  //aboutPage

  aboutSlogen1: "آموزش آنلاین حرفه ای",
  aboutSlogen2: " را به ما بسپارید",
  aboutText:
    "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد",
  Request: "درخواست مشاوره",
  onlineTraining: "چرا آموزش آنلاین را باما شروع کنید؟",
  textTraining: "اینجاییم که بهترین تجربه آموزش را لمس کنید",
  guarantee1: "ضمانت بهترین قیمت",
  guarantee2: "ضمانت بهترین امکانات​",
  guarantee3: "ضمانت بهترین کیفیت​",
  guarantee4: "ضمانت بهترین پشتیبانی​",
  guaranteeText:
    "ما تلاش کردیم و خواهیم کرد تا متنوع‌ترین و کامل‌ترین امکانات را به کاربران خود ارائه دهیم.",
  brandsTitr: "با همراهان ما آشنا شوید.",
  brandsText: "ما در حال بزرگ شدن هستیم!",
  acTitr: "چشم انداز آکادمی ما",
  acText:
    "با توجه به سرعت پیشرفت تکنولوژی و تحول صنعت آموزش دیجیتال ما تلاش می‌کنیم در زمینه تدریس آنلاین سرویس‌هایی شایسته کاربران عزیزمان ارائه کنیم تا حس مهم بودن و ارزشمند بودن را لمس کنند.",
  fooTitr: "ما را در شبکه های اجتماعی دنبال کنید",
  fooCopyRight1:
    "تمامی حقوق مادی و معنوی سایت متعلق به",
    fooCopyRight2:
    "SP ",
    fooCopyRight3:
    "می‌باشد و هر گونه کپی‌برداری پیگرد قانونی دارد.",
};

export default fa;
